#include<iostream>
#include<Windows.h>
using namespace std;
//Наша функція, яка визначає довжину рядка
int myStrLen(const char*);
//Дана функція підраховує кількість слів у рядку.
//Слово - це послідовність символів, яка відокремлена пробілами або іншими роздільниками.
int myCountWords(const char*);

int main()
{
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "--Приклади роботи з рядками--\n";
	char ch = 'A'; // Символ задається через ''
	cout << "ch = " << ch << endl;
	//Є мова С та С++ є два типи рядків: 
	//для С - рядик задаються через масив типу char
	//для С++ - рядки задаються через клас string
	//string - це просто обгортка для масиву char, яка надає додаткові можливості для роботи з рядками
	//char myStr[] = "Добре їсти добре спати"; //створимли масив і його зпавнили
	//Максимально сюди входить 100 символів, тому що ми створили масив з 100 елементів, але якщо ми спробуємо ввести більше символів, то ми отримаємо помилку, тому що ми виходимо за межі масиву
	char myStr[100]; //створили масив, але не заповнили його, тому він містить сміття
	cout << "Вкажіть гарне речення: ";
	cin.getline(myStr, 100, '\n'); //вводимо рядок з клавіатури, але не більше 100 символів, тому що ми створили масив з 100 елементів
	cout << "myStr = " << myStr << endl;
	//Довжина рядка
	//спеціальна фукнція яка допомагає обчислити довжину рядка - strlen
	int len = strlen(myStr); //strlen - це функція з бібліотеки cstring, яка повертає довжину рядка
	cout << "strlen(myStr) = " << len << endl;
	cout << "myStrlen(myStr) = " << myStrLen(myStr) << endl;
	cout << "Кількість слів у реченні = " << myCountWords(myStr) << endl;
}

int myStrLen(const char* str)
{
	int i = 0; //будемо рахувати символи в рядку поки не попаде нам '\0'
	//'\0' - у С та С++ - це символ кінця рядка, який автоматично додається в кінець рядка
	while (str[i] != '\0') //поки не зустрінеться символ кінця рядка
	{
		i++;
	}
	return i;
}

int myCountWords(const char* str)
{
	int count = 0; //рахуємо кількість слів
	int i = 0; //рахуємо символи в рядку - рухаємося по рядку поки не зустрінеться символ кінця рядка
	while (str[i] != '\0') //поки не зустрінеться символ кінця рядка
	{
		//якщо найшли пробіл, то значить 1 слова уже є
		if (str[i] == ' ') //якщо зустрічаємо пробіл, то це означає, що ми закінчили одне слово
		{
			count++; //збільшуємо лічильник слів
		}
		i++;
	}
	//якшр пробіл не знайли, значить маємо лише 1 слово, тому що якщо ми не знайдемо жодного пробіла, то це означає, що у нас є лише одне слово, яке не буде враховано в циклі, тому ми повинні додати 1 до лічильника слів, щоб врахувати це слово
	return count + 1; //повертаємо кількість слів, додаючи 1, тому що останнє слово не буде враховано, якщо ми не додамо 1
}