#include<iostream>
//Бібліотека для роботи з файлами
#include<fstream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "Робота з файлами\n";
	//є 2 режима роботи з файлами
	//1 - запис у файл - out
	//2 - читання файлу. - in
	// out - запис у файл
	// in - читання з файлу у Вашу програму(змінну)
	//для запису у файл є спеціальний тип
	//ofstream - для запису у файл
	//ifstream - читання з файлу.
	//Працює налогічно, як cout та сіn
	//Покажемо етапи роботи з файлами
	//1 - створюємо потік для запису файлу
	ofstream fout("my.txt"); //працюємо із файлом my.txt
	fout << "Сьогодні хороша погода\n";
	fout << "Мабуть піду купатися :)";
	fout.close(); //закриваю потік запису у файл.

}