#include<iostream>
#include<Windows.h>

int main()
{
	using namespace std;
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);

	cout << "Привіт козаки і козачки. Сьогодні дуже гарний ранок :)\n";
	//Масив - це набір однотипних даних, які об'єднані одніє назвою.
	//Масив від змінної відрізняється, тим, що він може зберігати декілька
	//елементів. Особливість C++ - у масиві можуть зберігатися лише змінні
	//одного типу. Коли на Python - там можуть бути різні типи змінних.
	
	int c; //данна змінна не ініціалізована - тобто ми не знаємо, яке значення там зберігається
	//Даний масив містить 10 елементів
	//Не можна динамічно додавати елементи у масив у C++(у Python можна)
	int marks[10]; //Створили масив, який зберігає цілі числа
	//Надамо значення масиву, через його індекси. Індекс - це зверення до елемента масив
	//Індексація масиву починається з 0
	marks[0] = 12; //надав значення 1 елементу масиву
	marks[1] = 8; marks[2] = 2;
	//Зараз у мене надано значення(ініціалізовано) 3 елемента масиву
	//Давайте виведемо веси масив на екран
	cout << "Адеса в пам'яті = " << marks << endl; //Так працювати не буде (ми у С++)
	for (int i = 0; i < 10; i++)
	{
		cout << "makrs[" << i << "] = " << marks[i] << "\n";
	}
	return 0;
}

