#include<iostream>
#include<Windows.h>
using namespace std;
// Якщо фукнція повератє значення, то
//перед назвою фукнції пишемо значення яке вона повертає
//Наприклад, якщо ціле число, то int або інший тип
int summ(); //повератає суму числе, які буде вводити користувач

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "---Повернення значення фукнції---\n";
	//Якби не було фукнції
	//int a, b;
	//cout << "Введіть перше число: ";
	//cin >> a;
	//cout << "Введіть друге число: ";
	//cin >> b;
	//int result = a + b; //повертає суму чисел

	int result = summ(); //виклик фукнції, яка повертає суму чисел
	cout << "Сума чисел: " << result << endl; //виводимо результат на екран	
	return 0;
}
int summ()
{
	int a, b;
	cout << "Введіть перше число: ";
	cin >> a;
	cout << "Введіть друге число: ";
	cin >> b;
	return a + b; //повертає суму чисел
}