#include<iostream>
#include<Windows.h>

int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "---Робота з циклом while---\n";
	//Цикл while - працює так само, як у Python
	//тобто синтаксис циклу while(умова_циклу)
	//{ -- початок тіла циклу
	//... // код у тіли циклу - що робить цикл
	//} -- кінець тіла циклу

	//Зробимо найпростіший цикл і проводимо аналогію із for
	//ініціалізаця змінних циклю
	int i = 10; // будемо виводити числа від 10 до 1
	while (i != 0) //умова продовження циклу, поки не досягнемо 0
	{
		cout << "i = " << i << "\n";
		i--; //змінуємо лічильник циклу на 1
	}
	cout << "Усім позитивчику :)\n";
	return 0;
}