#include<iostream>
#include<Windows.h>
using namespace std;

//Для групування коду у різних областях програми використовують 
// простори імен. Простір імен дозволяє уникнути конфліктів імен, 
// коли в програмі використовуються однакові імена для різних об'єктів. 
// Простір імен визначається за допомогою ключового слова namespace.

namespace OKKO //простір імен OKKO
{
	//має змінну для зберігання ціни на пальне
	double a95 = 92.90; //ціна 95 бензину на АЗС OKKO
}
namespace WOG //простір імен WOG
{
	//має змінну для зберігання ціни на пальне
	double a95 = 95.50; //ціна 95 бензину на АЗС WOG
}

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);

	cout<<"--Працємо із просторами імен--"<<endl;
	using namespace OKKO; //використовуємо простір імен OKKO 

	//виводимо ціну на 95 бензин на АЗС OKKO
	cout << "Ціна на 95 бензин на АЗС OKKO: " << a95 << endl;
	//виводимо ціну на 95 бензин на АЗС WOG
	cout << "Ціна на 95 бензин на АЗС WOG: " << WOG::a95 << endl;
	return 0;
}