#include<iostream>
#include<Windows.h>
using namespace std; // можна писати тут, тоді буде діяти на усі файли функції доступ
#include<ctime> //Для того, щоб отримати поточний час у програмі
#include<cstdlib> //Це бібліотека, яка містить стадартні функції rand, srand та інші

int main() 
{
	srand(time(NULL)); //time - повертає поточний час у вигляді числа.
	//srand - задає для таблиц Random - початок для генерації числе.
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "Будемо працювати із Random :)\n";
	//Random - це генерація випадкових чисел.
	//Random - працює на основі таблиці для генерації випадкових чисел.
	//Таблиця - це по суті масив числе по якому буде ходити сам Random
	//Для Random - важливо початкова його ініціалізація
	//Якщо краще ініціалузвати рандом - можна поточним часов, коли запускається програма.
	//Час у програмуванні можна представити у вигляд числа.
	//Береться певна дата і фіксується, як початок наприклад 1980 рік - це 0.
	//повертає кількість секунд з 1 січня 1970 року, тому seed змінюється кожну секунду.

	int max; //Максимальне значення Random
	cout << "Введіть обмеження для Random: ";
	cin >> max;

	//int randNumber = rand() % max + 1; //вертає число згідно таблиці Рандом
	//cout << "randNumber = " << randNumber << "\n";
	const int n = 10; // const - означає, що змінна не може змінювати значення
	//у ході роботи програми
	int mass[n]; //масив розміром n - має бути константою
	int i = 0; // початок масиву
	while (i < n) // перебираємо усі елементи масиву до 0 до n-1
	{
		//шукаємо остачу від ділення на max - Остача від діленя дає число менше за max
		mass[i] = rand() % max + 1; //rand() - поветає число(наприклад 7029) - 
		i++;
	}
	cout << "Наш масив заданий через Random:\n";
	for (i = 0; i < n; i++)
	{
		cout << mass[i] << "\t";
	}
	cout << "\n";
	//Наприклад ставимо обмеження 12 - це по 12 бальшній шкалі.
	//Потрібно порахувати кількість оцінок, які вище 10 - 10 включно
	int count=0; // Кількість оцінок, які вище 10 - 10 включно
	for (i = 0; i < n; i++)
	{
		if (mass[i] >= 10)
			count++;
	}
	cout << "Кільсть оцінок, які вище 10 = " << count << "\n";
	return 0;
}