#include<iostream> // для вводу-виводу
#include<Windows.h> // для роботи з консоллю Windows
using namespace std; // використання простору імен std для зручності
int main() // головна фукнція, повертає int - код завершення програми
{ // початок тіла функції main
	SetConsoleCP(65001); // встановлення кодування консолі на UTF-8 для коректного відображення символів
	SetConsoleOutputCP(65001); // встановлення кодування виводу консолі на UTF-8
	cout << "Робота з двохмірними масивами C++\n"; //виводимо призначення
	// n - кількість рядків, m - кількість стовпців
	// Створення двохмірного масиву розміром n x m
	// const - це константи - значення не може змінюватися
	const int n=2, m=2; // наші констати
	//n = 4; // помилка компіляції, оскільки n є константою
	// Створили масив розміром 2 x 2
	int A[n][m]; // значення у масиві не ініціалізовані.
	int i, j; // змінні для циклів - i для рядків, j для стовпців
	cout << "Введіть дані у масив розміро 2х2:\n";
	//cin >> A[0][0] >> A[0][1] >> A[1][0] >> A[1][1]; // введення даних у масив
	for (i = 0; i < n; i++) // буде ходити по рядках A[i] - це рядок
	{
		for (j = 0; j < m; j++) // ходимо по стовпчиках 
		{ // A[i][j] - це елемент у рядку i та стовпці j - комірка у таблиці
			cin >> A[i][j]; // введення даних у масив
			//cin >> A[i][j]; // введення даних у масив
		}
	}
	//Виводимо на екарн вміст масиву
	cout << "Вміст масиву:\n";
	for (i = 0; i < n; i++) // ідемо по рядках
	{
		for (j = 0; j < m; j++) // ідемо по стовпчиках - відповідно кожна комірка
		{
			cout << A[i][j] << "\t"; // виводимо елемент масиву та пробіл для розділення
		}
		cout << endl;
	}
	return 0;
}