#include<iostream>
#include<Windows.h>
using namespace std;

//повертаю масив у вигляді не вертаю
//Функція нічого не повертає, якщо буде int *, тоді це масив
void selectSort(int[], int);

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "---Сортування масивів---\n";
	//0,1,2,3,4,5
	int arr[6] = { 5, 2, 9, 1, 5, -3 };
	//починаємо з 1 елемента і шукаємо найменший і запамятовуємо його індекс, потім міняємо місцями з першим елементом, потім з другим і так далі
	int minIndex = 5;
	//тоді переставляємо 5 і 0 елемент місцями
	//тоді масив змінюється ось так: -3, 2, 9, 1, 5, 5
	//Якщо у нас на 0 індексі стоїть найменший елемент,
	//тоді ми починаємо з 2 елемента і шукаємо найменший, потім міняємо місцями з другим елементом і так далі
	minIndex = 3;
	//Отримуємо новий масив: -3, 1, 9, 2, 5, 5
	//Тоді на Index = 1 стоїть найший після 0 індекса, тому ми починаємо з 3 елемента і шукаємо найменший, потім міняємо місцями з третім елементом і так далі
	//Тепер починаємо з 3 елемента, а індекс 2
	minIndex = 3;
	//тоді мін місцями ідекс 2 і 3, отримуємо -3, 1, 2, 9, 5, 5
	//і так далі поки не відсоруємо. Можемо робити в циклі

	selectSort(arr, 6);

	for (int i = 0; i < 6; i++)
	{
		cout << arr[i] << '\t';
	}
	return 0;
}

void selectSort(int arr[], int size)
{
	//size-1, бо порівнюємо елемента
	//i та i+1, щоб получався i+1, тому size-1;
	for (int i = 0; i < size-1; i++)
	{
		int minIndex = i; // фіксуємо індекс найменшого елемента
		for (int j = i + 1; j < size; j++) 
		{
			if (arr[j] < arr[minIndex]) 
			{
				minIndex = j; // оновлюємо індекс найменшого елемента
			}
		}
		//знайшли найменший ідекс, ми має переставити 
		//відносно поточного ідексу i, з найменшим індексом minIndex
		swap(arr[i], arr[minIndex]); // міняємо місцями елементи
	}
}