#include<iostream>
#include<Windows.h>
using namespace std;

class A
{
public:
	A()
	{
		cout << "Працює конструктор класу A\n";
	}
	//Декструктор класу, як буде працювати
	~A() //викликаєть коли у класу немає потреби
	{
		cout << "---Знищення класу A---\n";
	}
};
class B
{
public:
	B()
	{
		cout << "Працює конструктор класу B\n";
	}
	~B()
	{
		cout << "---Знищили клас B---\n";
	}
};
//Робимо множинне наслідування і показуємо, як воно спрацьовує
class C : public B, public A
{
public:
	C()
	{
		cout << "Працює конструктор класу С\n";
	}
	~C()
	{
		cout << "----Знищили класа С----\n";
	}
};
int main()
{
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "Множине наслідування класів :)\n";
	//-----------------
	//A a; //Автоматично викликається конструктор класу 
	//B b; //Автоматично викликається конструктор класу 
	//C c; //Автоматично викликається конструктор класу 
	// ----------------
	//cout << "Працює функція main()\n";
	//if (1 == 1)
	//{
	//	A ananas; //виділяємо пам'ять під дану змінну(об'єкт)
	//	//У кінці блоку if - потреба у ananas зникає, бо закінується блок
	//	//має автоматично викликатися декструктор класу
	//}
	//cout << "Завершує роботу функція main()\n";

	//Констуктор викликається так B,A,C
	C calc;
	//Декструктор викликається С,A,B

	return 0;
}