#include<iostream>
#include<Windows.h>
using namespace std;

int main() 
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "---Динамічне виділення пам'яті---\n";
	//є потреба у користувача запросити певну кількість числе
	//Кількість чисел. - Наприклад - вік пацієнтів у лікарні
	cout << "Скільки у Вас сьогодні було пецієнтів: ";
	int n;
	cin >> n;
	//як динамічно виділити пам'ять для масиву з n елементів?
	//якщо я буду вводити інфомацію про 5 чи 7 пацієнтів,
	//то пам'ять буде використовуватися не ефективно, 
	// якщо ж я введу 1000 пацієнтів, то пам'ять буде використовуватися не ефективно
	// Це буде 4*1000 байт, а нам потрібно 4*n байт
	//int storage[1000]; //максисум пацієтів - 1000
	//Динамічно виділяємо потрібну кількість комірок пам'яті для зберігання інформації про пацієнтів
	int* storage = new int[n]; //динамічне виділення пам'яті для масиву з n елементів
	//Він вказує на першу комірку пам'яті
	cout<< "storage = " << storage << endl; //виведемо адресу першого елемента масиву
	for (int i = 0; i < n; i++)
	{
		cout << "Вкажіть вік пацієнта " << i + 1 << ": ";
		//у комірку під номером i запишемо вік пацієнта
		cin >> storage[i]; //заповнюємо масив даними про пацієнтів
	}

	for (int i = 0; i < n; i++)
	{
		cout << storage[i] << "\t";
	}
	cout << endl;

	delete[] storage; //звільняємо пам'ять, яку ми виділили для масиву
	storage = NULL; //старий спосіб задати пусте значення для вказівника
	//storage = nullptr; //новий спосіб задати пусте значення для вказівника
}