#include<iostream>
#include<Windows.h>

int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "Привіт! Гарний і чудовий ранок :)\n";

	//Для роботи з циклом for є спеціальний синтексис його запису
	//int i = 0;
	//i = i + 1; //так писати не зручно
	//i++; // аналогічно, як i = i + 1; - оператор інкременту
	//i = i - 1; // зменшення на 1
	//i--; // аналогічно, що i = i - 1;
	// Що робить цикл - повтор декілька разів 1 туж саму операцію
	// кількість постворів, може визначати, якась змінна n
	//for(ініціалізація_змінних_циклу;умова_продовження_циклу;лічильник_циклу)
	// { -- початок роботи циклу - тіла його
	// ...  тіло циклу - блок коду в циклі
	// } -- кінець тіла циклу
	//ініціалізація_змінних_циклу - виконується 1 раз під час початку циклу
	//умова_продовження_циклу - перевіряється на кожній ітерації циклу
	//лічильник_циклу - змінуює крок роботи циклу - виконується кожен раз після тіла циклу
	//Зробимо циклу, який виводиться числа від 1 до 10
	int n = 10; //визначає кількість ітерацій циклу
	for (int i = 1; i<=10; i++) //цикл - де пропущені усі блоки for (;;) - вічний цикл
	{
		cout << i << '\t'; // беремо в '' - якщо це 1 символ - "" - якщо більше 2 символів
	}
	cout << "\n";

	//Зроблю програму, у якій користувач вводить діапазон
	int begin, end;
	cout << "Вкажіть діапазон початок:\n";
	cin >> begin;
	cout << "Кінець діапазону:\n";
	cin >> end;
	for (int i = begin; i <= end; i++)
	{
		if (i % 2 == 0)
			cout << i << "\t";
	}
	cout << "\nДякуюємо :)";
	return 0;
}