#include<iostream>
#include<Windows.h>
using namespace std;
//Вказівник - це посилання на адресу пам'яті, де зберігається певне значення. Вказівник дозволяє нам працювати з цією адресою та змінювати значення, яке знаходиться за цією адресою. Вказівники є потужним інструментом у програмуванні на C++, оскільки вони дозволяють ефективно керувати пам'яттю та створювати складні структури даних.
//Вказівник позначається через * перед ім'ям змінної. Наприклад, int* ptr; оголошує вказівник на ціле число. Щоб присвоїти значення вказівнику, ми використовуємо оператор & для отримання адреси змінної. Наприклад, int x = 10; ptr = &x; присвоює адресу змінної x вказівнику ptr. Тепер ми можемо отримати доступ до значення, яке зберігається за цією адресою, використовуючи оператор * для розіменування вказівника. Наприклад, cout << *ptr; виведе значення 10 на екран.
void changeValue(int*); //Прототип функції - приймає адресу змінної - вказівник на ціле число

int main()
{
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "---Передача вказівника у функцію---\n";
	int max = 100;
	//& - у даному випадку бере адресу змінної max, тобто вказує на місце в пам'яті, де зберігається значення 100. Це дозволяє функції changeValue отримати доступ до цієї змінної та працювати з нею через вказівник.
	//changeValue(max); //помилка, бо у нас є * - має бути адреса пам'яті змінної
	changeValue(&max); //Передаємо адресу змінної max у функцію changeValue
	cout << "Змінна значення до допомогою вказівника " << max << endl; //Виводимо значення змінної max після виклику функції changeValue, щоб побачити, що вона була змінена через вказівник
}

void changeValue(int* ptr) //Оголошення функції - приймає адресу змінної - вказівник на ціле число
{
	cout << "Значення вказівника(ptr - це адреса) " << ptr << endl; //Виводимо адресу, на яку вказує вказівник
	//Так можна змінти значення змінної max, яка знаходиться за адресою, на яку вказує вказівник ptr. Оскільки ptr є вказівником на ціле число, ми можемо використовувати оператор розіменування * для доступу до значення, яке зберігається за цією адресою. Таким чином,
	*ptr = 200; //Змінюємо значення за адресою, на яку вказує вказівник ptr, на 200
	cout << "Значення *ptr = " << *ptr << endl; //Виводимо нове значення, яке зберігається за адресою, на яку вказує вказівник ptr
}