#include<iostream>
#include<Windows.h>
//Для роботи із часом,щоб отримати випадкові числа - на основі часу
#include<ctime> //для генерації випадкових чисел
using namespace std;

void simpleArray();
//Для двох мірних масивів динамічного типу, потрібно створити масив вказівників на масиви.
void dynamicArray();

int main()
{
	//береться поточний час у вигляді числа секунд, 
	// що пройшли з 1 січня 1970 року і використовується як початкове значення 
	// для генератора випадкових чисел.
	srand(time(0)); // ініціалізація генератора випадкових чисел на основі часу
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "----Динамічні багатомірні масиви----\n";
	//За допомогою вказівників можна будувати динамічні масиви.
	//Особливістю таких масивів є, можливість визначення їхнього розміру під чвс
	//виконання програми. Для цього використовують оператор new.
	//simpleArray();
	dynamicArray();

}

void simpleArray() 
{
	cout << "Вкажіть розмір масиву: ";
	int size;
	cin >> size;
	//Вказівник на 1 елемент масиву - виділяємо пам'ять під масив
	int* array = new int[size]; //створюємо динамічний масив
	for (int i = 0; i < size; i++)
	{
		array[i] = (rand()%20) + 1; // будуть числа від 0 до 19, але + 1 дасть від 1 до 20
	}
	for (int i = 0; i < size; i++)
	{
		cout << array[i] << "\t";
	}
	cout << "\n";
}

void dynamicArray()
{
	//Спробуємо побудувати двохмірний динамічний масив.
	//Двохмірний масив - це матриця - аналог таблиці Excel.
	//col це колонки у таблиці
	//row це рядки у таблиці
	const int col = 2, row = 3;
	int array[row][col]; //звичайни масив
	for (int i = 0; i < row; i++) // перший цикл іде по рядках
	{
		for (int j = 0; j < col; j++) //цей цикл іде по колонках у рядку
		{
			array[i][j] = (rand() % 30) + 1; //числав від 1 до 30 рандом
		}
	}
	cout << "Матриця " << col << "x" << row << "\n";
	for (int i = 0; i < row; i++)
	{
		for (int j = 0; j < col; j++)
		{
			cout << array[i][j] << "\t"; //виводимо рядок на екрна
		}
		cout << "\n"; //після виводу рядка ставимо перенос на новий рядок
	}
}