#include<iostream>
#include<Windows.h>
#include<ctime>
using namespace std;

int main() 
{
	srand(time(0)); // ініціалізація генератора випадкових чисел
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "Складні і прикольні масиви:\n";
	int rows, cols;
	cout << "Введіть кількість рядків: ";
	cin >> rows;
	cout << "Введіть кількість стовпців: ";
	cin >> cols;
	// * - вказівник на масив
	// ** - вказівник на вказівник на масив
	// Створення динамічного двовимірного масиву
	//спочатку виділяємо пам'ять для рядків, а потім для кожного рядка виділяємо пам'ять для стовпців
	//У звичайному випадку - це у нас int *arr=new int[rows]; - виділяємо пам'ять для рядків, а потім у циклі виділяємо пам'ять для стовпців
	//Для двох мірного масиву ми ставити ** - це зоначає, що 1 вказівник на масив, 
	// а другий вказівник на вказівник на масив. Тобто ми створюємо масив вказівників на масиви.
	//Другий вказівник він вказує на стовпці у рядку.
	
	int** arr = new int*[rows]; //для двох мірного масиву нам потрібно виділити пам'ять.
	for (int i = 0; i < rows; i++)
	{
		arr[i] = new int[cols]; // виділення пам'яті для стовпців
	}
	//перший цикл іде по рядках
	for (int i = 0; i < rows; i++)
	{
		//друий цикл іде по стовпцях у даному рядку
		for (int j = 0; j < cols; j++)
		{
			arr[i][j] = (rand() % 100) + 1;
		}
	}
	for (int i = 0; i < rows; i++)
	{
		for (int j = 0; j < cols; j++)
		{
			cout << arr[i][j] << "\t";
		}
		cout << "\n";
	}

	cout << "Вкажіть колонку, яку видалити із масиву(0 - " << cols - 1 << "): ";
	int colToDelete;
	cin >> colToDelete;
	//Для видалення колонки нам потрібно створити новий масив, який буде на 1 стовпець менше, 
	// ніж старий масив.
	int** arrNew = new int* [rows];
	int newCols = cols - 1; // нова кількість стовпців
	//Виділяємо пам'ять для нового масиву
	for (int i = 0; i < rows; i++)
	{
		arrNew[i] = new int[newCols]; // виділення пам'яті для нових колонок
	}
	//іду по старому масиву і копіюю дані у новий масив, пропускаючи колонку, яку потрібно видалити
	for (int i = 0; i < rows; i++)
	{
		int k = 0; // лічильник для нового масиву по колонах
		//друий цикл іде по стовпцях у даному рядку
		for (int j = 0; j < cols; j++)
		{
			if (j == colToDelete)
				continue; // пропускаю колонку, яку потрібно видалити
			arrNew[i][k] = arr[i][j]; // копіюю дані у новий масив
			k++; // збільшую лічильник для нового масиву по колонах
		}
	}
	//Тут виводжу новий масив, у якому немає однієї колонки, яку ми видалили
	for (int i = 0; i < rows; i++)
	{
		for (int j = 0; j < newCols; j++)
		{
			cout << arrNew[i][j] << "\t";
		}
		cout << "\n";
	}

	for (int i = 0; i < rows; i++)
	{
		delete[]arr[i]; // звільнями у ряках пам'zять для стовпців
	}
	delete[]arr; //Очищаємо память для рядків - тобто усю пам'ять, яку ми виділили для двох мірного масиву

}