#include<iostream>
#include<Windows.h>
#include<cstring>
using namespace std;

// ключенове слова - struct - для оголошення прототипу структури
struct Student // Student - це можна сказати наш вланий тип даних
{
	char name[80]; // ПІБ студента - масив символів - максимум 80
	double mark; //оцінка - з плаваючою комою
	int age; // вік студента
};

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "Усіх із св'ятом!\n";
	//масив - це набір однотипних даних
	//наприклад int list[10]; // десять числе цілого типу
	//Структура - це набрі даних, який може містити різні
	//типи даних.
	//Для того, щоб працювати із структурою потрібно на початку
	//оголосоити прототип структури 
	// (Щось схоже до прототипу функції). 
	// На основі прототипу структури можна оголошовути змінні
	//даного типу
	Student ivan; // На основі структури Student зробили змінну ivan
	//У структурі можна змінна називається полем
	// name - це поле, mark, age
	//Якщо ми оголосили змінну ми можемо звертатися до полів
	//змінної для цього використовується .
	ivan.age = 12; // полю age - записали 12
	ivan.mark = 4.5; //Оцінка 5
	//у масив ivan.name - копіюємо рядок до допомогою функцію 
	strcpy_s(ivan.name, "Марко Іван Петрович");
	
	cout << ivan.name << "\n"
		<< "Вік: " << ivan.age << "\tОцінка: " 
		<< ivan.mark << "\n";

	return 0;
}
