#include "iostream"
using namespace std;

void main()
{
	// endl - кінець рядка - перехід на новий рядок і кінець потоку
	cout << "Working int, double, bool, char" << endl;
	// зміннна - для збереження даних в програмі - певного типу
	// тип даних - певний набір - числа, символи, логічні значення
	//a = 12; // помилка - не вказано тип даних
	// int - ціле число
	// double - число з плаваючою комою
	// bool - логічне значення - true або false
	// char - символ
	int a = 22; // = присвоїти значення 22 змінній a, яка є цілим числом
	cout << "a = " << a << endl;
	// Дробові числа у C++ записуються з крапкою, а не з комою
	double b = 3.14; // змінна b типу double, яка зберігає число 3.14
	cout << "b = " << b << endl;
}