#pragma once // це означає що даний файл буде підлкючатися
#include<iostream> //Щоб був доступний ввід вивід на консоль і rand()
using namespace std;
//1 - раз, якільки би раз ви його не підключили
//Тут описуємо прототип класу, що класу буде робити
//Що він буде містити
class Matrix
{
private:
	//Пам'ять - виділяється згідно розміру матриці
	int** mat; //Двох міний масив, який буде динамічним
	int n; //кількість стовпчиків
	int m; //кількість рядків
public:
	//Конструктор - це фукнція, яка визивається при створені
	//самого класу. Конструктор співпадає по назві класу
	Matrix();//Конструктор по замовчуванню
	Matrix(int, int); //конструктор з параметрами
	Matrix(const Matrix&); //Конструктор копіювання
	//давайте нехай буде 
	void initRandom(); //заповнимо Рандомом
	void print(); //виводимо на екран
	Matrix & operator=(const Matrix&); //присвоїду 1 матрицю іншій a=b
	//const - даний метод не буде змінювати поточний об'єкт
	//Це метод вертає новий об'єкт. - поточний змінювати не буде
	Matrix plus(const Matrix&) const; //Буде робити додавання матриць
	//Давайте зробимо дружню функцію
	//friend - Matrix - будемо дружити з cout
	//cout - це по суті клас ostream і зним будемо дружити
	//Повертає посилання на ostream - щоб cout - міг далі нормально працювати
	//Приймає ostream - бо ми з ним дружимо.
	friend ostream & operator<<(ostream &, const Matrix&);
};

