#include<iostream>
#include<Windows.h>
using namespace std;
//Функція - це іменовий блок коду, який можна
//багато разів використовувати. 
//Фукнції бувать двох видів: 
// 1.Повертає значення
// 2.Не повертає значення (void)
// Якщо функція повертає значення, то ми його можеми використовувати
//Оголошувати функції потрібно перех фукнцією main
//Синтаксис оголошення функції:
//тип_повернення ім'я_функції(список_параметрів);
// або 
//тип_повернення ім'я_функції(список_параметрів)
//{ 
//  тіло функції
//}
// ім'я_функції - це як ми назвемо функцію
//повернення значення, якщо void - нічого не повертаємо
//якщо вказали тип int - Тоді повертаємо число
//список_параметрів - це дані, які ми передаються у фукнцію
//при її використані.

void myPrint() //Оголошення функції myPrint - не повертає значення
{ //Тіло функції - це код, який виконується при виклику функції
	cout << "Робота фукнції myPrint\n"; //код фукнції
} //Завершення функції - це кінець її тіла

//Використовую рекомендований принцип Оголошую протопип функції, а потім її реалізацію. Це дозволяє нам використовувати функцію в будь-якому місці коду, навіть до її реалізації.
void displayInfo(); //Прототип функції displayInfo	

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	//cout << "Привіт! Тут будуть наші функції\n";
	myPrint(); //Виклик функції - це коли ми використовуємо функцію, щоб вона виконала код, який в ній є
	displayInfo(); //Виклик функції displayInfo
	return 0;
}
//Так можна робити, але має бути прототип функції,
// щоб main знав, що ця функція існує і міг її знайти.
void displayInfo() //Реалізація функції displayInfo
{
	cout << "Це інформація про функцію displayInfo\n";
}