#include<iostream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "Привіт! Будемо вводити масив з клавіатури :)\n";

	const int n = 5; //кількість елементів масиву
	int peopleAge[n]; // створили масив на 5 елементів(n=5)

	cout << "---Вкажіть значення елементів масиву----\n";
	for (int i = 0; i < n; i++) //Будемо перебирати елементи масиву
	{
		cout << "a[" << i << "] = "; //Виводимо користувачу інформацію, який елемент ми вводимо
		cin >> peopleAge[i]; //Користувач вводить ціле число
	}

	cout << "Значеня в масиву: "; // виводимо на екран повідомлення
	for (int i = 0; i < n; i++) // Цикл буде перебирати елементи масиву
		cout << peopleAge[i] << "\t"; //виводимо елементи масиву через знак \t - табуляція
	cout << "\n"; // Робимо перехід на новий рядок
	return 0;
}
