// iostream - бібілотека для вводу/виводу на консоль C++
#include "iostream" // Підключаєм стандартну бібліотеку
//Для роботи проекту Вам потрібно зробити головну функцію
//Головна фукнція - це точка початку роботи програми
//main() - службове слова - для головної фукнції
void main() // void - стандартне слова - по повертає значення
{ //Початок блоук коду - main()
	//std - стандатний простір імен
	//cout - Console output - вивід на консоль
	//<< - оператор виводу на консоль
	// ; - кінець команди
	std::cout << "Hello my Friends!"; 
} //Кінець блоку коду - main()

