#include<iostream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "---Будемо виділяти пам'ять---\n";
	//виділяю пам'ять для одного цілого числа
	//вказівник буде вказувати на дану область пам'яті
	// 4 байти виділяємо у пам'яті і на них вказує вказівник ptr
	int* ptr = new int; // виділяємо пам'ять для одного цілого числа
	cout << "Ось адреса пам'яті куди вказує вказівник: " 
		<< ptr << endl;
	//Якщо пам'ять виділяється, то її потрібно звільняти.
	//Якщо ми її не звільнимо, то залишиться "сміття" в пам'яті, 
	// яке не використовується, але не може бути використано для інших цілей.
	*ptr = 42; // присвоюємо значення 42 в пам'ять, на яку вказує ptr
	cout << "*ptr = " << *ptr << endl; // виводимо значення, яке зберігається в пам'яті, на яку вказує ptr
	delete ptr; // звільняємо пам'ять, на яку вказує ptr

	cout << "Зробили delete ptr = " << ptr << endl; // після видалення пам'яті, на яку вказує ptr, ptr все ще містить адресу цієї пам'яті, але ця пам'ять вже не є дійсною для використання
	cout << "Зробили delete *ptr = " << *ptr << endl; // після видалення пам'яті, на яку вказує ptr, ptr все ще містить адресу цієї пам'яті, але ця пам'ять вже не є дійсною для використання
}