#include<iostream>
#include<Windows.h>
using namespace std;
void viewList(int*, int); //2 параметр - кількість елементів у масиві

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "---Вказіники, масиви та функції---\n";
	int size = 0;
	cout << "Вкажіть розмір масиву: ";
	cin >> size;
	int* myItems = new int[size]; //вказіник і виділив память для 7 елементів
	for (int i = 0; i < size; i++)
	{
		myItems[i] = i + 1; //заповнили масив послідовністю чисел від 1 до size
	}
	viewList(myItems, size); // передаємо адресу пам'яті, де зберігається перший елемент масиву
}

void viewList(int* list, int n)
{
	cout << "Вказівник на адресу пам'яті " << list << "\n";
	for (int i = 0; i < n; i++)
	{
		//Тип даних int у С++ займає 4 байти у пам'яті.
		//Щоб вказіник міг показати певний елемент в пам'яті
		//його потрібно перемістити в певну позицію пам'яті
		//Для переміщення можна зробити ось так *(list + i)
		cout << *(list + i) << "\t"; //по суті [i] - це *(list + i) - розіменування вказівника з певним зсувом, щоб отримати доступ до елементів масиву
		//cout << list[i] << "\t"; //по суті [i] - це *(list + i) - розіменування вказівника з певним зсувом, щоб отримати доступ до елементів масиву
	}
	cout << "\n";
}