#include<iostream>
#include<Windows.h>
using namespace std;

//Структура C++ - для зберігання власних типів даних
//У структурі, як в класі ми можемо об'єднувати декілька типів
struct Node //вузол в дереві, які зберігає інформацію по себе
{
	int data; // Дані які зберігаються в дереві
	Node* left; //Ліва гілка у вузлі
	Node* right; //права гілка

	//Конструктор - ініціалізація при створенні
	Node(int value) // передаємо значення,яке зберігаємо у вузлі
	{
		data = value;
		left = nullptr;
		right = nullptr;
	}
};

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "--Працює з бінарними деревами--\n";
	//Корінь дереве
	Node* root = new Node(10); //Це голова дерева і зберігає 10
	cout << "Голова дерева " << root->data << "\n";

	//Число 5 - вліво ідуть менші числа, у право більші
	root->left = new Node(5);
	cout << "Ліва гілка дерева " << root->left->data << "\n";
	root->right = new Node(15); // права гілка зберігає більше значенян за 10
	cout << "Права гілка дерева " << root->right->data << "\n";
	//Що буде,якщо в дерево буде заходити число 3
	root->left->left = new Node(3); //масимально іде в ліво на 3 рівень
	//Якщо в додаємо 7 - 7<10 - іде в ліво, а потім 7>5 іде в право
	root->left->right = new Node(7);
	/*
			10
		   /  \
		  5    15
		 / \   
		3   7 
*/
	return 0;
}