#include<iostream>
#include<Windows.h>

void main() 
{
	using namespace std;
	//1251 - windows кодування
	SetConsoleOutputCP(65001); // Для виводу кондування - utf-8
	SetConsoleCP(65001); // Для вводу інформації кодування
	//\n - перехід на новий рядок

	cout << "--Робота з оператор if--\n";

	// Python if - if умова: 
	//Умова - це вираз, який поверта true або false
	//>, <, >=, <=, !=, ==
	//Створення змінної 
	// тип_даний ІМЯ_ЗМІННОЇ;
	//int - цілі числа, bool - істина або хиба, double - дробові числа, char - символ
	int age = 25;
	cout << "age = " << age << endl;
	if (age == 23) //Умовний оператор if - перевіряє age == 23
	{//почато блоку, якщо умова вірна
		cout << "Умова вірна " << age << " == 23\n";
	}//кінець блоку, якщо умова була вірна
}