#include<iostream>
#include<Windows.h>
#include<cstring>
using namespace std;

class Student {
	//Зробимо усі змінні у середині класу public для простоти
	//Якщо є змінна у середині класу - вона зветься поле класу

private:
	char lastName[80]; //Прізвище
	char firstName[80]; //Ім'я
	int age; //Вік
	double avarageMark; //Середня оцінка
public:
	void setInfo()
	{
		cout << "Вкажіть прізвище: ->_";
		cin.getline(lastName, 80, '\n');
		cout << "Вкажіть ім'я: ->_";
		cin.getline(firstName, 80, '\n');
		//cin.ignore(); //Очищуємо буфер вводу від символу нового рядка, який залишився після вводу імені
		cout << "Вкажіть вік: ->_";
		cin >> age;
		cout << "Вкажіть середню оцінку: ->_";
		cin >> avarageMark;
	}

	void displayInfo()
	{
		cout << "\n-----Ви вказали інформацію про студента------\n";
		cout << lastName << " " << firstName << "\n";
		cout << "Вік: " << age << "\t"
			<< "Середня оцінка: " << avarageMark << "\n";
	}
};

int main() 
{
	//SetConsoleCP(CP_UTF8);
	//SetConsoleOutputCP(CP_UTF8);
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "----Вчммося працювати із об'єктами----\n";

	//На С++ придумали класи. 
	// Клас - це механізм для створення об'єктів
	// Клас дуже схожий на структуру. 
	// У класи є специфікатори доступу - private, public, protected 
	// Алгоритм дій: 
	// 1.Описуємо сам клас
	// 2.Вказуємо, що включає клас
	// 3.На основі даного класу створюємо змінні - об'єкти

	//На основі класу Student робимо змінну matviy - це об'єкт класу
	//Можна змінну класу називати - Екзепляри класу
	Student matviy; 
	//public - дає можливість доступу до змінних класу - полів класу
	matviy.setInfo(); // Цей метод для вводу інформації
	
	//У поле класу Maтвія змінив на Софія
	//Це проблема, бо клас має забороняти звертатися до полів на пряму
	//потрібно зробити, щоб у класі були 
	// приватні змінні і доступні змінні для програми
	//strcpy_s(matviy.lastName, "Софія");  //Ми її захисти від самого себе
	
	matviy.displayInfo(); //Виводимо дані про Матвія
}
