#include<iostream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);

	cout << "---Робота з вказіниками---" << "\n";
	
	//Кожна змінна зберігаєть у пам'яті і відповідає
	//певній адресі у пам'яті де вона знаходиться.
	int a = 10; //звичайна змінна зберігає значення 10
	//Через & отримуємо адресу змінної a
	//Адреса в пам'яті - 16 система числення, 
	//яка використовується для позначення місця розташування даних у пам'яті комп'ютера.
	cout << "Адреса змінної a: " << &a << "\n";
	//Десяикова система числення - 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
	//Шістнадцяткова система числення 
	// - 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F
	//У С++ є вказівники - що вказують на певну адресу в пам'яті, 
	// де зберігається певне значення.
	//Вказівники призначені для динамічного виділення пам'яті,
	//динамічне виділення пам'яті - це програма виділення пам'яті 
	// під час виконання програми.
	int* refA; // Вказівник на ціле число - зараз він пустий
	//Вказівник зберігає адресу змінної, а не саме значення.
	refA = &a; // refA тепер зберігає адресу змін
	cout << "refA = " << refA << "\n"; // Виводимо адресу, яку зберігає refA
	//Розміменування вказівників:
	//За допомогою оператора * можна отримати значення, 
	// яке зберігається за адресою, на яку вказує вказівник.
	cout << "Розіменування вкзаівника refA = " << *refA << "\n"; // Виводимо значення, яке зберігається за адресою refA
	//Змінуює значення за адресою, на яку вказує вказівник:
	*refA = 20; // Змінюємо значення за адресою, на яку вказує refA
	cout << "Змінна a після зміни через вказівник refA: " << a << "\n"; // Виводимо змінну a, щоб побачити зміни

	//Вказівник може бути констатою
	//Констатнта - це змінна, значення якої не можна міняти.
	const int* constRefA = &a; // constRefA - константний вказівник на ціле число
	//*constRefA = 30; // Помилка! Не можна змінювати значення через константний вказівник
}